In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
data = pd.read_csv("visitors.csv")

In [7]:
data

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
...,...,...,...,...,...,...,...,...
47949,William B. Henline,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47950,Ian T. Burris,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47951,James F. Albaugh,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47952,Jackie L. Finken,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47953,Grace M. Bauman,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN

In [8]:
data.head()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/15 9:30,1/6/15 23:59,NaN,potus,west wing,JointService Military Honor Guard

In [9]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  object
 3   appt_end_date      47954 non-null  object
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: object(8)
memory usage: 2.9+ MB

# Setting the appt_start_date Column into DateTime Format

In [10]:
data["appt_start_date"]

0           1/6/15 9:30
1           1/6/15 9:30
2           1/6/15 9:30
3           1/6/15 9:30
4           1/6/15 9:30
              ...
47949    12/18/15 16:30
47950    12/18/15 16:30
47951    12/18/15 16:30
47952    12/18/15 16:30
47953    12/18/15 16:30
Name: appt_start_date, Length: 47954, dtype: object

In [11]:
pd.to_datetime(data["appt_start_date"])

0       2015-01-06 09:30:00
1       2015-01-06 09:30:00
2       2015-01-06 09:30:00
3       2015-01-06 09:30:00
4       2015-01-06 09:30:00
                ...
47949   2015-12-18 16:30:00
47950   2015-12-18 16:30:00
47951   2015-12-18 16:30:00
47952   2015-12-18 16:30:00
47953   2015-12-18 16:30:00
Name: appt_start_date, Length: 47954, dtype: datetime64[ns]

In [12]:
data.tail()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
47949,William B. Henline,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47950,Ian T. Burris,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47951,James F. Albaugh,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47952,Jackie L. Finken,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47953,Grace M. Bauman,2015-12-16T00:00:00,12/18/15 16:30,12/18/15 23:59,NaN,POTUS/FLOTUS,State Floo,NaN

In [18]:
date_sample = "1/8/15 19:00"
date_format = "%m/%d/%y %H:%M"

In [20]:
data["appt_start_date"] = pd.to_datetime(data["appt_start_date"], format = date_format)

In [21]:
data["appt_start_date"]

0       2015-01-06 09:30:00
1       2015-01-06 09:30:00
2       2015-01-06 09:30:00
3       2015-01-06 09:30:00
4       2015-01-06 09:30:00
                ...
47949   2015-12-18 16:30:00
47950   2015-12-18 16:30:00
47951   2015-12-18 16:30:00
47952   2015-12-18 16:30:00
47953   2015-12-18 16:30:00
Name: appt_start_date, Length: 47954, dtype: datetime64[ns]

# Setting the appt_end_date Column into DateTime Format

In [22]:
data["appt_end_date"] = pd.to_datetime(data["appt_end_date"], format = date_format)

In [23]:
data["appt_end_date"]

0       2015-01-06 23:59:00
1       2015-01-06 23:59:00
2       2015-01-06 23:59:00
3       2015-01-06 23:59:00
4       2015-01-06 23:59:00
                ...
47949   2015-12-18 23:59:00
47950   2015-12-18 23:59:00
47951   2015-12-18 23:59:00
47952   2015-12-18 23:59:00
47953   2015-12-18 23:59:00
Name: appt_end_date, Length: 47954, dtype: datetime64[ns]

In [24]:
data.dtypes

name                         object
appt_made_date               object
appt_start_date      datetime64[ns]
appt_end_date        datetime64[ns]
visitee_namelast             object
visitee_namefirst            object
meeting_room                 object
description                  object
dtype: object

# Converting these columns details into months wise for better readability

In [25]:
month_wise = data["appt_end_date"].dt.strftime("%B %A")

In [26]:
month_wise

0        January Tuesday
1        January Tuesday
2        January Tuesday
3        January Tuesday
4        January Tuesday
              ...
47949    December Friday
47950    December Friday
47951    December Friday
47952    December Friday
47953    December Friday
Name: appt_end_date, Length: 47954, dtype: object

In [28]:
month_wise.value_counts()

June Monday           3935
December Friday       3776
December Wednesday    2990
June Wednesday        2732
December Thursday     2568
                      ...
June Saturday           12
January Wednesday        6
July Sunday              4
June Sunday              2
December Saturday        1
Name: appt_end_date, Length: 69, dtype: int64

In [29]:
length = data["appt_end_date"] - data["appt_start_date"]

In [30]:
length

0       0 days 14:29:00
1       0 days 14:29:00
2       0 days 14:29:00
3       0 days 14:29:00
4       0 days 14:29:00
              ...
47949   0 days 07:29:00
47950   0 days 07:29:00
47951   0 days 07:29:00
47952   0 days 07:29:00
47953   0 days 07:29:00
Length: 47954, dtype: timedelta64[ns]

In [31]:
data["appt_end_date"]

0       2015-01-06 23:59:00
1       2015-01-06 23:59:00
2       2015-01-06 23:59:00
3       2015-01-06 23:59:00
4       2015-01-06 23:59:00
                ...
47949   2015-12-18 23:59:00
47950   2015-12-18 23:59:00
47951   2015-12-18 23:59:00
47952   2015-12-18 23:59:00
47953   2015-12-18 23:59:00
Name: appt_end_date, Length: 47954, dtype: datetime64[ns]

In [32]:
data["appt_start_date"]

0       2015-01-06 09:30:00
1       2015-01-06 09:30:00
2       2015-01-06 09:30:00
3       2015-01-06 09:30:00
4       2015-01-06 09:30:00
                ...
47949   2015-12-18 16:30:00
47950   2015-12-18 16:30:00
47951   2015-12-18 16:30:00
47952   2015-12-18 16:30:00
47953   2015-12-18 16:30:00
Name: appt_start_date, Length: 47954, dtype: datetime64[ns]

In [33]:
length.min()

Timedelta('0 days 02:29:00')

In [34]:
length.max()

Timedelta('16 days 12:59:00')

In [35]:
length.sum()

Timedelta('21210 days 14:02:00')